[{"id":"jd-senior-backend","name":"Senior Backend Engineer","department":"Engineering","content":"# Senior Backend Engineer\n\n## About the Role\nWe're looking for a Senior Backend Engineer to join our growing engineering team. You'll be responsible for designing, building, and maintaining our core platform services.\n\n## Responsibilities\n- Design and implement scalable backend services and APIs\n- Lead technical discussions and code reviews\n- Mentor junior engineers and contribute to team growth\n- Collaborate with product and design teams to deliver features\n- Ensure high code quality through testing and best practices\n- Participate in on-call rotations\n\n## Requirements\n- 5+ years of backend development experience\n- Strong proficiency in Node.js, Python, or Go\n- Experience with PostgreSQL, Redis, and message queues\n- Understanding of distributed systems and microservices\n- Excellent problem-solving and communication skills\n\n## Nice to Have\n- Experience with Kubernetes and cloud platforms (AWS/GCP)\n- Contributions to open source projects\n- Experience in fintech or insurtech","version":1,"isActive":true,"createdAt":"2025-12-29T02:23:42.019","updatedAt":"2025-12-29T02:23:42.019"}, 
 {"id":"jd-product-designer","name":"Product Designer","department":"Design","content":"# Product Designer\n\n## About the Role\nWe're seeking a talented Product Designer to help shape the future of our platform. You'll work closely with product and engineering teams to create intuitive, beautiful user experiences.\n\n## Responsibilities\n- Lead end-to-end design for new features and products\n- Conduct user research and usability testing\n- Create wireframes, prototypes, and high-fidelity designs\n- Maintain and evolve our design system\n- Collaborate with engineers to ensure design quality\n- Present designs to stakeholders and incorporate feedback\n\n## Requirements\n- 3+ years of product design experience\n- Strong portfolio demonstrating UX/UI expertise\n- Proficiency in Figma and prototyping tools\n- Experience with design systems\n- Excellent communication and collaboration skills\n\n## Nice to Have\n- Experience with B2B or enterprise products\n- Basic understanding of HTML/CSS\n- Motion design skills","version":1,"isActive":true,"createdAt":"2025-12-29T02:23:42.047","updatedAt":"2025-12-29T02:23:42.047"}, 
 {"id":"jd-devops-engineer","name":"DevOps Engineer","department":"Engineering","content":"# DevOps Engineer\n\n## About the Role\nWe're seeking a DevOps Engineer to help build and maintain our cloud infrastructure. You'll work on CI/CD pipelines, monitoring, and ensuring system reliability.\n\n## Responsibilities\n- Design and maintain cloud infrastructure on AWS/GCP\n- Build and optimize CI/CD pipelines\n- Implement monitoring, alerting, and logging solutions\n- Ensure security best practices across infrastructure\n- Automate deployment and operational tasks\n- Participate in incident response and on-call rotations\n\n## Requirements\n- 3+ years of DevOps/SRE experience\n- Strong experience with Kubernetes and Docker\n- Proficiency with IaC tools (Terraform, Pulumi)\n- Experience with CI/CD platforms (GitHub Actions, GitLab CI)\n- Understanding of networking and security\n\n## Nice to Have\n- Certifications (AWS, GCP, CKA)\n- Experience with service mesh (Istio, Linkerd)\n- Background in software development","version":1,"isActive":true,"createdAt":"2025-12-29T02:23:42.049","updatedAt":"2025-12-29T02:23:42.049"}, 
 {"id":"jd-frontend-engineer","name":"Frontend Engineer","department":"Engineering","content":"# Frontend Engineer\n\n## About the Role\nWe're looking for a Frontend Engineer to build beautiful, performant user interfaces. You'll work closely with designers and backend engineers to deliver exceptional user experiences.\n\n## Responsibilities\n- Build and maintain React/Next.js applications\n- Implement responsive, accessible UI components\n- Optimize frontend performance and bundle size\n- Write unit and integration tests\n- Contribute to our component library\n- Collaborate with designers on implementation\n\n## Requirements\n- 3+ years of frontend development experience\n- Strong proficiency in React and TypeScript\n- Experience with modern CSS (Tailwind, styled-components)\n- Understanding of web performance optimization\n- Familiarity with testing frameworks (Jest, Playwright)\n\n## Nice to Have\n- Experience with Next.js and server-side rendering\n- Animation and motion design skills\n- Contributions to design systems","version":1,"isActive":true,"createdAt":"2025-12-29T02:23:42.049","updatedAt":"2025-12-29T02:23:42.049"}, 
 {"id":"jd-growth-lead","name":"Growth Lead","department":"Growth","content":"<h2><span style=\"color: rgb(59, 130, 246);\"><strong>Your Objective</strong></span></h2><p>You’re a dynamic Growth Marketing Leader, who will be responsible for crafting and executing a comprehensive marketing strategy. This includes overseeing various marketing domains such as product marketing, performance marketing, events, social media marketing, and partnerships.</p><p></p><p></p><h2><strong>How you'll help us achieve it</strong></h2><ul><li><p>Develop and oversee the company's growth strategy in collaboration with Curacel's Management Team.</p></li><li><p>Establish a robust growth and marketing division within Curacel</p></li><li><p>Regularly report and forecast crucial business metrics, including customer growth, retention, revenue, engagement, NPS, and profit margins.</p></li><li><p>Innovate in user acquisition, targeting the first major milestones of customers.</p></li><li><p>Gain an in-depth understanding of our current and potential users and their motivations.</p></li><li><p>Master our customer acquisition channels, marketing funnels, and tools.</p></li><li><p>Manage the marketing budget effectively across various tools and channels.</p></li><li><p>Lead growth experimentation, optimising existing channels and exploring new opportunities.</p></li><li><p>Champion a data-driven culture, emphasising instrumentation and attribution.</p></li><li><p>Work closely with the Product Team to refine user experience, copy, and messaging.</p></li><li><p>Maintain and develop the Curacel brand and voice, ensuring consistency across all communications.</p></li><li><p>Lead and expand the Growth/Marketing Team.</p></li></ul><h2><strong>In your first month, you'll</strong></h2><ul><li><p>Learn what we do, how our product works and what new products we are building.</p></li><li><p>Build a structure for monitoring progress and measuring the success of campaigns and marketing activities.</p></li><li><p>Gain an in-depth understanding of our current and potential users and their motivations.</p></li><li><p>Review existing content calendar and create a new one for our social media, newsletter and blog.</p></li><li><p>Lead the creation of reports and white papers for insurance, claims management, fraud detection, embedded insurance in Africa.</p></li><li><p>Lead the creation of video testimonials of our clients across Africa.</p></li></ul><p><strong>Requirements</strong></p><ul><li><p>Minimum of 6 years of experience in B2B Marketing, with a focus on both small and medium-sized businesses, SEO and growth marketing.</p></li><li><p>Proficient in marketing analytics and applying insights to optimise campaigns.</p></li><li><p>Demonstrated ability in being analytical and data-driven.</p></li><li><p>Strong leadership skills, with the ability to work with cross-functional teams.</p></li><li><p>Proven track record of growth, with examples and outcomes of previous campaigns.</p></li><li><p>Exceptional written, oral, and organisational skills.</p></li><li><p>Experience in managing comprehensive, data-driven marketing, and communication strategies.</p></li><li><p>Familiarity with relevant marketing tools and platforms for campaign activation.</p></li></ul><h2><strong>Bonus points if you</strong></h2><ul><li><p>Have B2B SaaS marketing experience</p></li></ul><h2><strong>Key details</strong></h2><ul><li><p>The growth marketing position is a full-time position and reports to the CEO.</p></li></ul><p><strong>Benefits:</strong></p><ul><li><p>Subsidized health insurance</p></li><li><p>Monthly data allowance</p></li></ul><p></p>","version":4,"isActive":true,"createdAt":"2025-12-29T02:23:42.048","updatedAt":"2026-01-02T16:00:15.239"}, 
 {"id":"8b0fce2d-4fb9-4b1f-800b-849c7c9f1dcf","name":"GTM Engineer","department":"Commercial","content":"<div class=\"jd-section\">\n<h2>Overview</h2>\n<p>Curacel is a leading African insurtech company using AI, data, and modern software to transform insurance infrastructure across the continent. We partner with insurers, brokers, and healthcare providers to eliminate fraud, improve efficiency, and create seamless insurance experiences at scale.\n\nAs a GTM (Go-To-Market) Engineer in the Commercial team, you will sit at the intersection of product, engineering, sales, and marketing. Your role is to design, build, and optimize the technical and operational systems that power Curacel’s revenue growth—from lead acquisition and onboarding to integrations, pricing experiments, and customer expansion.\n\nThis role matters because Curacel’s growth depends not just on great products, but on how efficiently and intelligently we take them to market. You will directly impact revenue velocity, customer experience, and scalability, enabling Curacel to grow faster and smarter across multiple markets.</p>\n</div>\n<div class=\"jd-section\">\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design, implement, and maintain GTM systems and tooling that support sales, partnerships, and customer success (CRM, automation, analytics, integrations).</li>\n<li>Work closely with Sales, Marketing, Product, and Engineering teams to translate commercial needs into scalable technical solutions.</li>\n<li>Build and optimize workflows for lead management, onboarding, pricing, and customer lifecycle management.</li>\n<li>Develop dashboards and reporting frameworks to track funnel performance, revenue metrics, and GTM efficiency.</li>\n<li>Support pre-sales and post-sales technical engagements, including demos, integrations, and solution design for enterprise customers.</li>\n<li>Identify bottlenecks in the go-to-market process and proactively design experiments and improvements.</li>\n<li>Own documentation and knowledge-sharing around GTM systems, processes, and best practices.</li>\n<li>Continuously evaluate and recommend new tools, technologies, and processes to improve speed, accuracy, and impact.</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Required Qualifications</h2>\n<ul>\n<li>3–6 years of experience in GTM Engineering, Sales Engineering, Revenue Operations, Growth Engineering, or a similar role.</li>\n<li>Strong technical foundation with experience in APIs, system integrations, automation tools, and data workflows.</li>\n<li>Hands-on experience with CRM platforms (e.g., HubSpot, Salesforce) and sales/marketing automation tools.</li>\n<li>Ability to analyze data, build dashboards, and derive actionable insights to support commercial decisions.</li>\n<li>Strong problem-solving skills with a bias for ownership, experimentation, and execution.</li>\n<li>Excellent communication skills and ability to work cross-functionally with technical and non-technical stakeholders.</li>\n<li>Bachelor’s degree in Engineering, Computer Science, Information Systems, or a related field (or equivalent practical experience).</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience working in a high-growth startup or scale-up environment, preferably in SaaS or fintech/insurtech.</li>\n<li>Familiarity with data tools such as SQL, Python, or modern BI platforms.</li>\n<li>Experience supporting enterprise or B2B sales cycles in emerging markets.</li>\n<li>Understanding of insurance, healthcare, or financial services ecosystems in Africa.</li>\n<li>Experience designing pricing experiments, revenue models, or growth experiments.</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Benefits & Perks</h2>\n<ul>\n<li>Competitive salary and performance-based incentives.</li>\n<li>Opportunity to work on high-impact products transforming insurance across Africa.</li>\n<li>Fast-paced, ownership-driven culture aligned with Curacel’s PRESS values.</li>\n<li>Clear growth paths, learning opportunities, and exposure to leadership.</li>\n<li>Flexible work environment with a strong focus on outcomes over hours.</li>\n<li>Collaborative, innovative team that values initiative, urgency, and creativity.</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>About Curacel</h2>\n<p>Curacel’s mission is to make insurance work—better, faster, and more transparently—for everyone. We leverage AI, automation, and data to combat fraud, streamline claims, and modernize insurance operations across Africa.\n\nOur culture is built around our PRESS values: Passionate Work, Relentless Growth, Empowered Action, Sense of Urgency, and Seeing Possibilities. We believe in giving our people ownership, trusting them to make decisions, and supporting them to grow.\n\nAt Curacel, your work has real impact. Every system you build, process you improve, and customer you enable helps strengthen insurance infrastructure and expand access to financial protection across the continent.</p>\n</div>","version":1,"isActive":true,"createdAt":"2026-01-03T19:28:21.825","updatedAt":"2026-01-03T19:28:21.825"}, 
 {"id":"0e0cd892-95dc-442b-b548-20bdc1f9cdcf","name":"PeopleOps Associate","department":"People","content":"<div class=\"jd-section\">\n<h2>Overview</h2>\n<p>Curacel is a leading African insurtech company using AI and modern technology to power insurance infrastructure, claims automation, and fraud detection across emerging markets. We partner with insurers to make insurance more accessible, efficient, and trustworthy, while building products that operate at scale in fast‑moving environments.\n\nAs a PeopleOps Associate, you will play a critical role in supporting Curacel’s people operations function—ensuring our employees have an excellent experience from onboarding to growth and beyond. You will work closely with the People team and cross‑functional leaders to execute HR processes, maintain compliance, and support a high‑performance, people‑first culture.\n\nThis role matters because Curacel’s success is powered by its people. As we scale rapidly across markets, the PeopleOps Associate helps ensure structure, clarity, and care in how we hire, support, and grow our talent—living out our PRESS values every step of the way.</p>\n</div>\n<div class=\"jd-section\">\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Support end‑to‑end employee lifecycle processes including onboarding, documentation, confirmation, and offboarding</li>\n<li>Maintain accurate and up‑to‑date employee records across HR systems and ensure data integrity</li>\n<li>Assist with recruitment coordination including interview scheduling, candidate communication, and offer documentation</li>\n<li>Support performance management processes, feedback cycles, and people analytics reporting</li>\n<li>Ensure compliance with internal HR policies, labor laws, and company standards across jurisdictions</li>\n<li>Partner with team leads and managers to address employee queries and support day‑to‑day people operations needs</li>\n<li>Assist in organizing employee engagement initiatives, learning programs, and culture‑building activities</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Required Qualifications</h2>\n<ul>\n<li>1–3 years of experience in HR, People Operations, or a similar administrative or operations role</li>\n<li>Bachelor’s degree in Human Resources, Business Administration, Psychology, or a related field</li>\n<li>Strong organizational skills with high attention to detail and ability to manage multiple priorities</li>\n<li>Working knowledge of core HR processes including onboarding, employee records, and basic labor compliance</li>\n<li>Proficiency with HR tools, Google Workspace, and basic data reporting or spreadsheets</li>\n<li>Excellent written and verbal communication skills with a people‑first mindset</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience working in a tech startup, high‑growth company, or distributed team environment</li>\n<li>Familiarity with HRIS platforms, ATS tools, or payroll systems</li>\n<li>Basic understanding of African labor laws or multi‑country HR operations</li>\n<li>Interest in people analytics, process improvement, or automation within HR</li>\n<li>Professional HR certification (e.g., CIPM, SHRM, HRCI) is a plus</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Benefits & Perks</h2>\n<ul>\n<li>Competitive salary and benefits package</li>\n<li>Opportunity to grow within a fast‑scaling African technology company</li>\n<li>Exposure to strategic people operations and startup leadership</li>\n<li>Collaborative, inclusive, and high‑ownership work culture</li>\n<li>Learning and development support aligned with Relentless Growth</li>\n<li>Flexible work environment built on trust and empowered action</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>About Curacel</h2>\n<p>Curacel’s mission is to make insurance work better for everyone by building the digital infrastructure that insurers need to operate efficiently and transparently. We envision a future where technology removes friction from insurance across Africa and beyond.\n\nOur culture is driven by our PRESS values—Passionate Work, Relentless Growth, Empowered Action, Sense of Urgency, and Seeing Possibilities. We move fast, take ownership, and encourage bold thinking while supporting one another.\n\nAt Curacel, your work has real impact: enabling insurers to serve millions better, reducing fraud, and strengthening trust in financial systems. If you’re excited about building people‑centered systems in a high‑impact environment, Curacel is the place for you.</p>\n</div>","version":1,"isActive":true,"createdAt":"2026-01-05T13:23:27.942","updatedAt":"2026-01-05T13:23:27.942"}, 
 {"id":"8aeb17a5-5ca8-467d-b4b3-b7c3ad2c25a4","name":"AI/ML Engineer","department":"AI/ML","content":"<div class=\"jd-section\">\n<h2>Overview</h2>\n<p>Curacel is a leading African insurtech company building the digital infrastructure that powers insurance operations across the continent. Through cutting-edge AI, data, and automation, we help insurers reduce fraud, improve claims processing, and deliver better experiences to millions of customers. At Curacel, we move fast, take ownership, and build products that solve real, high-impact problems.\n\nAs an AI/ML Engineer, you will play a critical role in designing, building, and deploying machine learning models that sit at the core of our products. You will work on real-world challenges such as fraud detection, claims automation, risk scoring, and intelligent decision systems, transforming raw data into scalable, production-ready AI solutions.\n\nThis role matters because AI is central to Curacel’s mission. Your work will directly influence product performance, customer trust, and business outcomes across multiple insurance partners. You will help shape how AI is applied responsibly and effectively in one of Africa’s most impactful fintech sectors.</p>\n</div>\n<div class=\"jd-section\">\n<h2>Key Responsibilities</h2>\n<ul>\n<li>Design, develop, train, and deploy machine learning models for production use cases such as fraud detection, claims automation, and predictive analytics</li>\n<li>Collaborate closely with product managers, backend engineers, and data analysts to translate business problems into scalable AI/ML solutions</li>\n<li>Build and maintain end-to-end ML pipelines, including data preprocessing, model training, evaluation, deployment, and monitoring</li>\n<li>Continuously improve model performance through experimentation, feature engineering, and model optimization</li>\n<li>Ensure models are reliable, explainable, and production-ready, with proper monitoring and retraining strategies</li>\n<li>Work with large, complex datasets and ensure data quality, integrity, and security</li>\n<li>Document models, processes, and experiments to support knowledge sharing and long-term maintainability</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Required Qualifications</h2>\n<ul>\n<li>3+ years of hands-on experience building and deploying machine learning models in a production environment</li>\n<li>Strong proficiency in Python and common ML libraries such as TensorFlow, PyTorch, Scikit-learn, or similar</li>\n<li>Solid understanding of machine learning fundamentals, including supervised and unsupervised learning, model evaluation, and feature engineering</li>\n<li>Experience working with structured and unstructured data, including data cleaning and preprocessing</li>\n<li>Familiarity with APIs, microservices, and integrating ML models into backend systems</li>\n<li>Experience with cloud platforms (AWS, GCP, or Azure) and ML deployment workflows</li>\n<li>Bachelor’s degree in Computer Science, Engineering, Data Science, or a related field (or equivalent practical experience)</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience with MLOps tools and practices such as model versioning, CI/CD for ML, and model monitoring</li>\n<li>Knowledge of fraud detection, risk modeling, or financial services use cases</li>\n<li>Experience working with big data tools or data warehouses</li>\n<li>Familiarity with NLP, computer vision, or deep learning applications</li>\n<li>Experience working in a fast-paced startup or scale-up environment</li>\n<li>Advanced degree (Master’s or PhD) in a relevant field</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>Benefits & Perks</h2>\n<ul>\n<li>Opportunity to work on high-impact, real-world AI problems affecting millions of users across Africa</li>\n<li>A culture of ownership, innovation, and empowered decision-making aligned with Curacel’s PRESS values</li>\n<li>Competitive compensation and performance-based growth opportunities</li>\n<li>Collaborative, fast-paced work environment with talented engineers and product leaders</li>\n<li>Learning and development support, including exposure to modern AI tools and production systems</li>\n<li>Flexible work arrangements and a results-driven culture</li>\n</ul>\n</div>\n<div class=\"jd-section\">\n<h2>About Curacel</h2>\n<p>Curacel’s mission is to make insurance work better for everyone by building the digital infrastructure that insurers need to operate efficiently and transparently. We envision an Africa where insurance is trusted, accessible, and powered by intelligent technology.\n\nOur culture is guided by our PRESS values: Passionate Work, Relentless Growth, Empowered Action, Sense of Urgency, and Seeing Possibilities. We believe in moving fast, taking ownership, and continuously learning.\n\nBy partnering with leading insurers and leveraging AI at scale, Curacel is transforming how claims are processed, how fraud is detected, and how trust is built in insurance systems across the continent. Joining Curacel means being part of a team creating meaningful impact at the intersection of technology and financial inclusion.</p>\n</div>","version":1,"isActive":true,"createdAt":"2026-01-08T16:54:32.694","updatedAt":"2026-01-08T16:54:32.694"}]
