[{"id":"default-offer-template","name":"Standard Offer Letter","description":"Standard employment offer letter template","bodyHtml":"\n        <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px;\">\n          <div style=\"text-align: center; margin-bottom: 40px;\">\n            <h1 style=\"color: #1a365d; margin: 0;\">OFFER OF EMPLOYMENT</h1>\n            <p style=\"color: #4a5568; margin-top: 10px;\">Confidential</p>\n          </div>\n          \n          <p>Dear {candidate_name},</p>\n          \n          <p>We are pleased to offer you the position of <strong>{role}</strong> at {company_name}. We believe your skills and experience will be a valuable addition to our team.</p>\n          \n          <h3 style=\"color: #2d3748; border-bottom: 1px solid #e2e8f0; padding-bottom: 10px;\">Position Details</h3>\n          <ul>\n            <li><strong>Title:</strong> {role}</li>\n            <li><strong>Department:</strong> {department}</li>\n            <li><strong>Manager:</strong> {manager_name}</li>\n            <li><strong>Start Date:</strong> {start_date}</li>\n            <li><strong>Location:</strong> {location}</li>\n          </ul>\n          \n          <h3 style=\"color: #2d3748; border-bottom: 1px solid #e2e8f0; padding-bottom: 10px;\">Compensation</h3>\n          <p>Your starting annual salary will be <strong>{salary} {currency}</strong>, paid in accordance with the company's standard payroll schedule.</p>\n          \n          <h3 style=\"color: #2d3748; border-bottom: 1px solid #e2e8f0; padding-bottom: 10px;\">Benefits</h3>\n          <p>You will be eligible to participate in the company's benefits programs, including health insurance, retirement plan, and paid time off, subject to the terms and conditions of those programs.</p>\n          \n          <h3 style=\"color: #2d3748; border-bottom: 1px solid #e2e8f0; padding-bottom: 10px;\">At-Will Employment</h3>\n          <p>Your employment with {company_name} will be \"at-will,\" meaning that either you or the company may terminate the employment relationship at any time, with or without cause or notice.</p>\n          \n          <h3 style=\"color: #2d3748; border-bottom: 1px solid #e2e8f0; padding-bottom: 10px;\">Acceptance</h3>\n          <p>This offer is contingent upon successful completion of a background check. Please sign below to indicate your acceptance of this offer.</p>\n          \n          <div style=\"margin-top: 40px;\">\n            <p>We are excited about the prospect of you joining our team!</p>\n            <p>Sincerely,<br/>The {company_name} Team</p>\n          </div>\n          \n          <div style=\"margin-top: 60px; border-top: 2px solid #e2e8f0; padding-top: 20px;\">\n            <p><strong>ACCEPTANCE</strong></p>\n            <p>I, {candidate_name}, accept the offer of employment as described above.</p>\n            <div style=\"margin-top: 30px;\">\n              <p>Signature: /sig1/</p>\n              <p>Date: /date1/</p>\n            </div>\n          </div>\n        </div>\n      ","bodyMarkdown":null,"includeNda":true,"includePii":true,"variableSchema":{"role": {"type": "text", "label": "Job Role", "required": true}, "salary": {"type": "number", "label": "Salary", "required": true}, "currency": {"type": "text", "label": "Currency", "required": true, "defaultValue": "USD"}, "location": {"type": "text", "label": "Location", "required": true}, "department": {"type": "text", "label": "Department", "required": true}, "start_date": {"type": "date", "label": "Start Date", "required": true}, "company_name": {"type": "text", "label": "Company Name", "required": true, "defaultValue": "Curacel"}, "manager_name": {"type": "text", "label": "Manager Name", "required": true}, "candidate_name": {"type": "text", "label": "Candidate Name", "required": true}},"isActive":true,"createdAt":"2025-12-07T23:37:11.992","updatedAt":"2025-12-07T23:37:11.992","employmentType":null}, 
 {"id":"part-time-template","name":"Part-time Employment Contract","description":"Standard part-time employment contract","bodyHtml":"\n    <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px; line-height: 1.8; color: #1a1a1a;\">\n      <p style=\"margin-bottom: 15px; text-align: left;\">Contract of Employment</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Dear %{employee_name},</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Curacel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Commencement Date: %{employment_start_date}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Position: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Job Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">%{duties}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Salary: You will be paid a starting net monthly salary of %{gross_salary}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Benefits:%{benefits}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Equity: 0.1 - 0.5% Options</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">5-year vesting, 1-year cliff.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Additional performance-tied option grants.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Hours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Place of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Bonus: %{bonus}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">To Pass Probation</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Your performance during the probationary period will be assessed against the objectives outlined in Appendix A</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Taxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Annual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Should it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Appraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Confidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Termination of Employment and Notice Period: This Agreement may be terminated by:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Death</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">With or Without Cause.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Notwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Please note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Nothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">your misappropriation of funds or property of the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">neglect of your duties;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">or any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Restrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Canvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Solicit or entice away any of the Company's employees or contract employees</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Transfer your services to the Company's customer, supplier or sponsor.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Employment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Conflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Part-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Loss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Governing Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Entire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Severability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">We reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">If you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.</p>\n    </div>\n  ","bodyMarkdown":"Contract of Employment\n\nDear %{employee_name},\n\nCuracel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):\n\nCommencement Date: %{employment_start_date}\n\nPosition: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine. \n\nJob Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.\n\n%{duties}\n\nSalary: You will be paid a starting net monthly salary of %{gross_salary}\n\n \n\nBenefits:%{benefits}\n\nEquity: 0.1 - 0.5% Options\n\n5-year vesting, 1-year cliff.\n\nAdditional performance-tied option grants.\n\nHours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.\n\nPlace of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.\n\nBonus: %{bonus}\n\n \n\nTo Pass Probation\n\nYour performance during the probationary period will be assessed against the objectives outlined in Appendix A\n\nTaxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.\n\nAnnual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.\n\nShould it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.\n\nAppraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.\n\nDisciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.\n\nConfidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.\n\nTermination of Employment and Notice Period: This Agreement may be terminated by: \n\nDeath \n\nDisabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company \n\nWith or Without Cause. \n\nNotwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period. \n\nPlease note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover. \n\nNothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including: \n\nany material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company; \n\nany material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company; \n\nany conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country; \n\nyour misappropriation of funds or property of the Company; \n\nneglect of your duties; \n\nor any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company. \n\nRestrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to: \n\nCanvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect; \n\nSolicit or entice away any of the Company's employees or contract employees\n\nTransfer your services to the Company's customer, supplier or sponsor. \n\nEmployment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.\n\nConflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Part-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.\n\nLoss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.\n\nGoverning Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.\n\nEntire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.\n\nSeverability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.\n\nWe reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.\n\nIf you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.","includeNda":true,"includePii":true,"variableSchema":{"bonus": {"type": "text", "label": "Bonus", "required": false}, "duties": {"type": "text", "label": "Primary Duties", "required": false}, "benefits": {"type": "text", "label": "Benefits", "required": false}, "job_title": {"type": "text", "label": "Job Title", "required": true}, "gross_salary": {"type": "text", "label": "Gross Salary", "required": true}, "employee_name": {"type": "text", "label": "Employee Name", "required": true}, "supervisor_title": {"type": "text", "label": "Supervisor Title", "required": true}, "employment_start_date": {"type": "date", "label": "Employment Start Date", "required": true}, "offer_expiration_date": {"type": "date", "label": "Offer Expiration Date", "required": true}},"isActive":true,"createdAt":"2025-12-08T01:39:22.184","updatedAt":"2025-12-08T01:39:22.184","employmentType":"PART_TIME"}, 
 {"id":"contractor-template","name":"Contractor Agreement","description":"Standard contractor agreement","bodyHtml":"\n    <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px; line-height: 1.8; color: #1a1a1a;\">\n      <p style=\"margin-bottom: 15px; text-align: left;\">Contractor Agreement</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Dear %{employee_name},</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Curacel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Commencement Date: %{contractor engagement_start_date}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Position: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Job Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">%{duties}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Salary: You will be paid a starting net monthly salary of %{gross_salary}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Benefits:%{benefits}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Equity: 0.1 - 0.5% Options</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">5-year vesting, 1-year cliff.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Additional performance-tied option grants.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Hours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Place of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Bonus: %{bonus}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">To Pass Probation</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Your performance during the probationary period will be assessed against the objectives outlined in Appendix A</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Taxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Annual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Should it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Appraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Confidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Termination of Employment and Notice Period: This Agreement may be terminated by:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Death</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">With or Without Cause.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Notwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Please note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Nothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">your misappropriation of funds or property of the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">neglect of your duties;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">or any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Restrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Canvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Solicit or entice away any of the Company's employees or contract employees</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Transfer your services to the Company's customer, supplier or sponsor.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Employment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Conflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Loss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Governing Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Entire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Severability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">We reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">If you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.</p>\n    </div>\n  ","bodyMarkdown":"Contractor Agreement\n\nDear %{employee_name},\n\nCuracel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):\n\nCommencement Date: %{contractor engagement_start_date}\n\nPosition: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine. \n\nJob Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.\n\n%{duties}\n\nSalary: You will be paid a starting net monthly salary of %{gross_salary}\n\n \n\nBenefits:%{benefits}\n\nEquity: 0.1 - 0.5% Options\n\n5-year vesting, 1-year cliff.\n\nAdditional performance-tied option grants.\n\nHours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.\n\nPlace of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.\n\nBonus: %{bonus}\n\n \n\nTo Pass Probation\n\nYour performance during the probationary period will be assessed against the objectives outlined in Appendix A\n\nTaxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.\n\nAnnual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.\n\nShould it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.\n\nAppraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.\n\nDisciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.\n\nConfidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.\n\nTermination of Employment and Notice Period: This Agreement may be terminated by: \n\nDeath \n\nDisabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company \n\nWith or Without Cause. \n\nNotwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period. \n\nPlease note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover. \n\nNothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including: \n\nany material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company; \n\nany material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company; \n\nany conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country; \n\nyour misappropriation of funds or property of the Company; \n\nneglect of your duties; \n\nor any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company. \n\nRestrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to: \n\nCanvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect; \n\nSolicit or entice away any of the Company's employees or contract employees\n\nTransfer your services to the Company's customer, supplier or sponsor. \n\nEmployment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.\n\nConflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.\n\nLoss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.\n\nGoverning Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.\n\nEntire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.\n\nSeverability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.\n\nWe reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.\n\nIf you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.","includeNda":true,"includePii":true,"variableSchema":{"duties": {"type": "text", "label": "Primary Duties", "required": false}, "benefits": {"type": "text", "label": "Benefits", "required": false}, "job_title": {"type": "text", "label": "Job Title", "required": true}, "gross_salary": {"type": "text", "label": "Contract Amount", "required": true}, "employee_name": {"type": "text", "label": "Contractor Name", "required": true}, "supervisor_title": {"type": "text", "label": "Supervisor Title", "required": true}, "employment_end_date": {"type": "date", "label": "Contract End Date", "required": false}, "employment_start_date": {"type": "date", "label": "Contract Start Date", "required": true}, "offer_expiration_date": {"type": "date", "label": "Offer Expiration Date", "required": true}},"isActive":true,"createdAt":"2025-12-08T01:39:22.206","updatedAt":"2025-12-08T01:39:22.206","employmentType":"CONTRACTOR"}, 
 {"id":"confirmation-template","name":"Employment Confirmation Contract","description":"Employment contract sent when confirming employment after probation period","bodyHtml":"\n    <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px; line-height: 1.8; color: #1a1a1a;\">\n      <p style=\"margin-bottom: 15px; text-align: left;\">Employment Confirmation Contract</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Dear %{employee_name},</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Curacel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Commencement Date: %{employment_start_date}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Position: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Job Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">%{duties}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Salary: You will be paid a starting net monthly salary of %{gross_salary}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Benefits:%{benefits}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Equity: 0.1 - 0.5% Options</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">5-year vesting, 1-year cliff.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Additional performance-tied option grants.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Hours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Place of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Bonus: %{bonus}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">To Pass Probation</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Your performance during the probationary period will be assessed against the objectives outlined in Appendix A</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Taxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Annual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Should it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Appraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Confidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Termination of Employment and Notice Period: This Agreement may be terminated by:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Death</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">With or Without Cause.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Notwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Please note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Nothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">your misappropriation of funds or property of the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">neglect of your duties;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">or any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Restrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Canvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Solicit or entice away any of the Company's employees or contract employees</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Transfer your services to the Company's customer, supplier or sponsor.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Employment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Conflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Loss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Governing Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Entire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Severability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">We reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">If you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.</p>\n    </div>\n  ","bodyMarkdown":"Employment Confirmation Contract\n\nDear %{employee_name},\n\nCuracel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):\n\nCommencement Date: %{employment_start_date}\n\nPosition: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine. \n\nJob Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.\n\n%{duties}\n\nSalary: You will be paid a starting net monthly salary of %{gross_salary}\n\n \n\nBenefits:%{benefits}\n\nEquity: 0.1 - 0.5% Options\n\n5-year vesting, 1-year cliff.\n\nAdditional performance-tied option grants.\n\nHours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.\n\nPlace of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.\n\nBonus: %{bonus}\n\n \n\nTo Pass Probation\n\nYour performance during the probationary period will be assessed against the objectives outlined in Appendix A\n\nTaxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.\n\nAnnual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.\n\nShould it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.\n\nAppraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.\n\nDisciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.\n\nConfidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.\n\nTermination of Employment and Notice Period: This Agreement may be terminated by: \n\nDeath \n\nDisabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company \n\nWith or Without Cause. \n\nNotwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period. \n\nPlease note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover. \n\nNothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including: \n\nany material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company; \n\nany material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company; \n\nany conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country; \n\nyour misappropriation of funds or property of the Company; \n\nneglect of your duties; \n\nor any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company. \n\nRestrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to: \n\nCanvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect; \n\nSolicit or entice away any of the Company's employees or contract employees\n\nTransfer your services to the Company's customer, supplier or sponsor. \n\nEmployment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.\n\nConflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.\n\nLoss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.\n\nGoverning Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.\n\nEntire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.\n\nSeverability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.\n\nWe reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.\n\nIf you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.","includeNda":true,"includePii":true,"variableSchema":{"job_title": {"type": "text", "label": "Job Title", "required": true}, "gross_salary": {"type": "text", "label": "Gross Salary", "required": true}, "employee_name": {"type": "text", "label": "Employee Name", "required": true}, "supervisor_title": {"type": "text", "label": "Supervisor Title", "required": true}, "employment_start_date": {"type": "date", "label": "Employment Start Date", "required": true}, "offer_expiration_date": {"type": "date", "label": "Confirmation Date", "required": true}},"isActive":true,"createdAt":"2025-12-08T01:43:13.685","updatedAt":"2025-12-08T01:43:13.685","employmentType":null}, 
 {"id":"intern-template","name":"Internship Agreement","description":"Standard internship agreement","bodyHtml":"\n    <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px; line-height: 1.8; color: #1a1a1a;\">\n      <p style=\"margin-bottom: 15px; text-align: left;\">Internship Agreement</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Dear %{employee_name},</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Curacel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Commencement Date: %{internship_start_date}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Position: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Job Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">%{duties}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Salary: You will be paid a starting net monthly salary of %{gross_salary}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Benefits:%{benefits}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Equity: 0.1 - 0.5% Options</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">5-year vesting, 1-year cliff.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Additional performance-tied option grants.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Hours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Place of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Bonus: %{bonus}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">To Pass Probation</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Your performance during the probationary period will be assessed against the objectives outlined in Appendix A</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Taxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Annual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Should it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Appraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Confidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Termination of Employment and Notice Period: This Agreement may be terminated by:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Death</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">With or Without Cause.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Notwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Please note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Nothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">your misappropriation of funds or property of the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">neglect of your duties;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">or any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Restrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Canvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Solicit or entice away any of the Company's employees or contract employees</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Transfer your services to the Company's customer, supplier or sponsor.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Employment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Conflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Loss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Governing Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Entire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Severability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">We reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">If you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.</p>\n    </div>\n  ","bodyMarkdown":"Internship Agreement\n\nDear %{employee_name},\n\nCuracel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):\n\nCommencement Date: %{internship_start_date}\n\nPosition: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine. \n\nJob Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.\n\n%{duties}\n\nSalary: You will be paid a starting net monthly salary of %{gross_salary}\n\n \n\nBenefits:%{benefits}\n\nEquity: 0.1 - 0.5% Options\n\n5-year vesting, 1-year cliff.\n\nAdditional performance-tied option grants.\n\nHours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.\n\nPlace of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.\n\nBonus: %{bonus}\n\n \n\nTo Pass Probation\n\nYour performance during the probationary period will be assessed against the objectives outlined in Appendix A\n\nTaxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.\n\nAnnual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.\n\nShould it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.\n\nAppraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.\n\nDisciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.\n\nConfidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.\n\nTermination of Employment and Notice Period: This Agreement may be terminated by: \n\nDeath \n\nDisabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company \n\nWith or Without Cause. \n\nNotwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period. \n\nPlease note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover. \n\nNothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including: \n\nany material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company; \n\nany material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company; \n\nany conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country; \n\nyour misappropriation of funds or property of the Company; \n\nneglect of your duties; \n\nor any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company. \n\nRestrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to: \n\nCanvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect; \n\nSolicit or entice away any of the Company's employees or contract employees\n\nTransfer your services to the Company's customer, supplier or sponsor. \n\nEmployment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.\n\nConflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.\n\nLoss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.\n\nGoverning Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.\n\nEntire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.\n\nSeverability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.\n\nWe reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.\n\nIf you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.","includeNda":true,"includePii":true,"variableSchema":{"duties": {"type": "text", "label": "Primary Duties", "required": false}, "benefits": {"type": "text", "label": "Benefits", "required": false}, "job_title": {"type": "text", "label": "Internship Position", "required": true}, "gross_salary": {"type": "text", "label": "Stipend", "required": false}, "employee_name": {"type": "text", "label": "Intern Name", "required": true}, "supervisor_title": {"type": "text", "label": "Supervisor Title", "required": true}, "employment_end_date": {"type": "date", "label": "Internship End Date", "required": false}, "employment_start_date": {"type": "date", "label": "Internship Start Date", "required": true}, "offer_expiration_date": {"type": "date", "label": "Offer Expiration Date", "required": true}},"isActive":true,"createdAt":"2025-12-08T01:39:41.254","updatedAt":"2025-12-08T01:39:41.254","employmentType":"INTERN"}, 
 {"id":"full-time-template","name":"Full-time Employment Contract","description":"Standard full-time employment contract for Curacel Systems Limited","bodyHtml":"\n    <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px; line-height: 1.8; color: #1a1a1a;\">\n      <p style=\"margin-bottom: 15px; text-align: left;\">Contract of Employment</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Dear %{employee_name},</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Curacel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Commencement Date: %{employment_start_date}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Position: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Job Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">%{duties}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Salary: You will be paid a starting net monthly salary of %{gross_salary}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Benefits:%{benefits}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Equity: 0.1 - 0.5% Options</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">5-year vesting, 1-year cliff.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Additional performance-tied option grants.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Hours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Place of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Bonus: %{bonus}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">To Pass Probation</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Your performance during the probationary period will be assessed against the objectives outlined in Appendix A</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Taxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Annual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Should it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Appraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Confidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Termination of Employment and Notice Period: This Agreement may be terminated by:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Death</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Disabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">With or Without Cause.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Notwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Please note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Nothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">any conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">your misappropriation of funds or property of the Company;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">neglect of your duties;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">or any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Restrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to:</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Canvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect;</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Solicit or entice away any of the Company's employees or contract employees</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Transfer your services to the Company's customer, supplier or sponsor.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Employment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Conflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Loss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Governing Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Entire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Severability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">We reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">If you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.</p>\n    </div>\n  ","bodyMarkdown":"Contract of Employment\n\nDear %{employee_name},\n\nCuracel Systems Limited (the \"Company\"), a company incorporated under the laws of the Federal Republic of Nigeria, having its office at 19 Adeyemi Lawson Street, Ikoyi, Lagos, is pleased to employ you under the following terms and conditions (the \"Agreement\"):\n\nCommencement Date: %{employment_start_date}\n\nPosition: For the period of your employment under this Agreement, the Company agrees to employ you in the position of %{job_title}. You will report to the %{supervisor_title} or to such other person as the Company subsequently may determine. \n\nJob Description: You will perform the duties and have the responsibilities and authority customarily performed and held by an employee in your position or as otherwise may be assigned or delegated to you by the Company including but not limited to your Job Description as provided in this Agreement.\n\n%{duties}\n\nSalary: You will be paid a starting net monthly salary of %{gross_salary}\n\n \n\nBenefits:%{benefits}\n\nEquity: 0.1 - 0.5% Options\n\n5-year vesting, 1-year cliff.\n\nAdditional performance-tied option grants.\n\nHours of Work: The Company's standard working hours are from 9 am to 5 pm However, you are required to put in the necessary hours required to properly execute the tasks assigned to you.\n\nPlace of Work: The Company's primary location is at 16, Oyekan Road, Surulere, Lagos, Nigeria, where you will be expected to provide the Services twice/thrice a week. However you may be expected to provide the Services remotely or at any other place determined by the Company.\n\nBonus: %{bonus}\n\n \n\nTo Pass Probation\n\nYour performance during the probationary period will be assessed against the objectives outlined in Appendix A\n\nTaxes & Statutory Deductions: The Company will deduct and remit statutory taxes on your behalf in accordance with applicable laws. You agree that the Company does not have a duty to design its compensation to minimise your tax liabilities and you will not make any claim against the Company or its Board of Directors related to tax liabilities arising from your compensation.\n\nAnnual Leave, Absence from Work: You are entitled to a paid annual leave period of 14 working days annually, which you may take any time after you have been confirmed and with prior approval of the Company, at a time that will not interfere with the proper performance of your duties. You cannot accumulate and carry over your annual leave entitlement from one year to the following year. If you are unable to work as a result of ill health or injury, you shall notify the Company by providing a medical certificate setting out the reasons for absence from work. You shall be able to access seven (7) business days of sick leave within a year.\n\nShould it become necessary, you are entitled to maternity leave for a period of three (3) consecutive months commencing at any time before the expected delivery date or as directed by a medical practitioner. You shall however notify the Company at least four (4) weeks before you intend taking the maternity leave.\n\nAppraisals/Promotions: You shall be appraised by the management of the Company or any other authorised person from time to time and promotion shall be based on your performance.\n\nDisciplinary and Grievance Procedure: You shall be subject to the disciplinary and grievance procedures as provided in the Company's employee handbook from time to time.\n\nConfidentiality and Invention/ Intellectual Property Assignment Agreement: You will be required, as a condition of your employment with the Company, to sign the Company's standard Confidentiality and Invention/Intellectual Property Assignment Agreement provided in Appendix II of this Agreement.\n\nTermination of Employment and Notice Period: This Agreement may be terminated by: \n\nDeath \n\nDisabilities, which include any physical or mental impairment which, as reasonably determined by the Company, renders you unable to perform the essential functions of your position at the Company \n\nWith or Without Cause. \n\nNotwithstanding the above should you wish to terminate this Agreement during the Probation Period, one (1) month's notice in writing must be given to the Company. Salary may be paid or forfeited in lieu of notice. After your Confirmation, should either Party wish to terminate this relationship, one (1) month's notice in writing must be given to the non-terminating Party. Salary may be paid or forfeited in lieu of notice by either Party. This notice period is deemed necessary as it is pertinent that you do a proper handover and annual leave periods will not be accepted as part of the notice period. \n\nPlease note that payment in lieu of notice will only be accepted following approval from your line manager that you have concluded assigned tasks and done proper handover. \n\nNothing in this Agreement shall prevent the Company from terminating your employment without notice or salary in lieu of notice in the appropriate circumstances including: \n\nany material breach by you of this Agreement, the Confidential Information Non-Disclosure & Intellectual Property/ Invention Assignment Agreement between you and the Company, or any other written agreement between you and the Company, if such breach causes material harm to the Company; \n\nany material failure by you to comply with the Company's written policies or rules, as they may be in effect from time to time during your Employment, if such failure causes material harm to the Company; \n\nany conviction of, or a plea of \"guilty\" to a crime under the laws of the Federal Republic of Nigeria or any other country; \n\nyour misappropriation of funds or property of the Company; \n\nneglect of your duties; \n\nor any gross or wilful misconduct by you resulting in a material loss to the Company or material damage to the reputation of the Company. \n\nRestrictive Covenants: While employed by the Company and for 12 months after the termination of your employment, you shall not seek to: \n\nCanvass or solicit business, orders or custom for any products or services provided by this business from any customer, supplier or sponsor; either current, existing or in prospect; \n\nSolicit or entice away any of the Company's employees or contract employees\n\nTransfer your services to the Company's customer, supplier or sponsor. \n\nEmployment Relationship: Employment with the Company is for no specific period of time. Your employment with the Company will be \"at will,\" meaning that either you or the Company may terminate your employment at any time and for any reason, with or without cause. Any contrary representations which may have been made to you are superseded by this offer. This is the full and complete agreement between you and the Company regarding this issue. Although your job duties, title, compensation and benefits, as well as the Company's personnel policies and procedures, may change from time to time, the \"at will\" nature of your employment may only be changed in an express written agreement signed by you and the Company's Managing Director.\n\nConflicting Employment: You hereby agree that, during the duration of this Agreement you shall be committed to carrying out your duties in the Company and will not engage in any other employment (Full-time or Part-time), occupation, consulting, or other business activity nor will you engage in any other activities that conflict with your obligations to the Company without the prior written consent of the Company.\n\nLoss, Damage and Return of Company Property: The Company shall not accept any responsibility for the loss or damage of your personal property, motor vehicle and/or any other personal belongings brought into the Company's premises in the course of your employment. Upon termination of employment with the Company for any reason or at any time prior at the Company's request, you shall return all property belonging to the Company or its affiliates including but not limited to, any Company-provided laptops, computers, cell phones, or other equipment, or documents, or property belonging to the Company.\n\nGoverning Law: The validity, interpretation, construction and performance of this Agreement, and all acts and transactions pursuant to this Agreement and the rights and obligations of the parties hereto shall be governed, construed and interpreted in accordance with the Laws of the Federal Republic of Nigeria.\n\nEntire Agreement: This Agreement contains the entire Agreement between the parties hereto with respect to the subject matter hereof, and supersedes all prior arrangements or understandings (whether written or oral) with respect thereto.\n\nSeverability: If any provision in this Agreement is held to be invalid or unenforceable in any jurisdiction, the validity and enforceability of all remaining provisions contained in this Agreement shall not in any way be affected or impaired.\n\nWe reserve the right to make reasonable changes to this Agreement and will notify you in writing of such changes. Such changes will be deemed to be accepted unless you notify us of any objections you may have before the commencement date. By signing this Agreement, you confirm with the Company that you are under no contractual or other legal obligations that would prohibit you from performing your duties with the Company.\n\nIf you wish to accept this offer, please sign and date both copies of this Agreement and both copies of the enclosed Confidential Information and Intellectual Property/Invention Assignment Agreement on or before %{offer_expiration_date} and return them to the undersigned representative of the Company.","includeNda":true,"includePii":true,"variableSchema":{"bonus": {"type": "text", "label": "Bonus", "required": false}, "duties": {"type": "text", "label": "Primary Duties", "required": false}, "benefits": {"type": "text", "label": "Benefits", "required": false}, "job_title": {"type": "text", "label": "Job Title", "required": true}, "gross_salary": {"type": "text", "label": "Gross Salary", "required": true}, "employee_name": {"type": "text", "label": "Employee Name", "required": true}, "supervisor_title": {"type": "text", "label": "Supervisor Title", "required": true}, "employment_start_date": {"type": "date", "label": "Employment Start Date", "required": true}, "offer_expiration_date": {"type": "date", "label": "Offer Expiration Date", "required": true}},"isActive":true,"createdAt":"2025-12-08T01:39:22.027","updatedAt":"2025-12-29T02:23:41.797","employmentType":"FULL_TIME"}, 
 {"id":"termination-template","name":"Employment Termination Contract","description":"Contract sent when terminating employment","bodyHtml":"\n    <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px; line-height: 1.8; color: #1a1a1a;\">\n      <p style=\"margin-bottom: 15px; text-align: left;\">Employment Termination Notice</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Dear %{employee_name},</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">This letter serves as formal notice of the termination of your employment with Curacel Systems Limited (the \"Company\"), effective %{termination_date}.</p>\n<ul style=\"margin-left: 20px; margin-bottom: 15px; padding-left: 20px;\"><li style=\"margin-bottom: 10px; margin-left: 20px;\">Termination Details:</li>\n<li style=\"margin-bottom: 10px; margin-left: 20px;\">Last Day of Employment: %{termination_date}</li>\n<li style=\"margin-bottom: 10px; margin-left: 20px;\">Notice Period: %{notice_period}</li>\n<li style=\"margin-bottom: 10px; margin-left: 20px;\">Final Pay: %{final_pay}</li></ul>\n<p style=\"margin-bottom: 15px; text-align: left;\">Please return all Company property including laptops, computers, cell phones, and any other equipment or documents belonging to the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">If you have any questions, please contact HR.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Sincerely,\n%{signature_block}</p>\n    </div>\n  ","bodyMarkdown":"Employment Termination Notice\n\nDear %{employee_name},\n\nThis letter serves as formal notice of the termination of your employment with Curacel Systems Limited (the \"Company\"), effective %{termination_date}.\n\nTermination Details:\n- Last Day of Employment: %{termination_date}\n- Notice Period: %{notice_period}\n- Final Pay: %{final_pay}\n\nPlease return all Company property including laptops, computers, cell phones, and any other equipment or documents belonging to the Company.\n\nIf you have any questions, please contact HR.\n\nSincerely,\n%{signature_block}","includeNda":false,"includePii":true,"variableSchema":{"final_pay": {"type": "text", "label": "Final Pay", "required": true}, "employee_name": {"type": "text", "label": "Employee Name", "required": true}, "notice_period": {"type": "text", "label": "Notice Period", "required": true}, "signature_block": {"type": "text", "label": "Signature Block", "required": true}, "termination_date": {"type": "date", "label": "Termination Date", "required": true}},"isActive":true,"createdAt":"2025-12-08T01:43:13.689","updatedAt":"2025-12-08T01:43:13.689","employmentType":null}, 
 {"id":"nda-template","name":"Non-Disclosure and Invention Agreement","description":"Agreement to protect confidential information and inventions","bodyHtml":"\n    <div style=\"font-family: Georgia, serif; max-width: 800px; margin: 0 auto; padding: 40px; line-height: 1.8; color: #1a1a1a;\">\n      <p style=\"margin-bottom: 15px; text-align: left;\">Non-Disclosure and Invention Assignment Agreement</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Dear %{employee_name},</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">This Non-Disclosure and Invention Assignment Agreement (\"Agreement\") is entered into between you and Curacel Systems Limited (the \"Company\").</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Confidentiality: You agree to maintain the confidentiality of all proprietary and confidential information of the Company.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Invention Assignment: You agree to assign to the Company all inventions, discoveries, and improvements made during your employment.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">This Agreement is effective as of %{agreement_date} and shall survive the termination of your employment.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">By signing below, you acknowledge that you have read, understood, and agree to be bound by the terms of this Agreement.</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Signature: %{employee_signature}\nDate: %{signature_date}</p>\n<p style=\"margin-bottom: 15px; text-align: left;\">Company Representative: %{signature_block}</p>\n    </div>\n  ","bodyMarkdown":"Non-Disclosure and Invention Assignment Agreement\n\nDear %{employee_name},\n\nThis Non-Disclosure and Invention Assignment Agreement (\"Agreement\") is entered into between you and Curacel Systems Limited (the \"Company\").\n\nConfidentiality: You agree to maintain the confidentiality of all proprietary and confidential information of the Company.\n\nInvention Assignment: You agree to assign to the Company all inventions, discoveries, and improvements made during your employment.\n\nThis Agreement is effective as of %{agreement_date} and shall survive the termination of your employment.\n\nBy signing below, you acknowledge that you have read, understood, and agree to be bound by the terms of this Agreement.\n\nSignature: %{employee_signature}\nDate: %{signature_date}\n\nCompany Representative: %{signature_block}","includeNda":false,"includePii":true,"variableSchema":{"employee_name": {"type": "text", "label": "Employee Name", "required": true}, "agreement_date": {"type": "date", "label": "Agreement Date", "required": true}, "signature_date": {"type": "date", "label": "Signature Date", "required": true}, "signature_block": {"type": "text", "label": "Company Signature Block", "required": true}, "employee_signature": {"type": "text", "label": "Employee Signature", "required": true}},"isActive":true,"createdAt":"2025-12-08T01:43:13.691","updatedAt":"2025-12-08T01:43:13.691","employmentType":null}, 
 {"id":"8658db61-57b0-4bd0-ae40-cf7a2785eab7","name":"BYOD Agreement","description":"Bring Your Own Device undertaking form for employees using personal devices for work","bodyHtml":"\n<h1 style=\"text-align: center; font-size: 24px; font-weight: bold; margin-bottom: 24px;\">\n  BRING YOUR OWN DEVICE (BYOD) UNDERTAKING FORM\n</h1>\n\n<div style=\"margin-bottom: 24px;\">\n  <p style=\"margin-bottom: 12px;\">\n    I, <strong>{{employee_name}}</strong>, working in the <strong>{{department}}</strong> department\n    as <strong>{{job_title}}</strong>, hereby acknowledge that I will be using my personal device(s)\n    for official company work purposes.\n  </p>\n</div>\n\n<h2 style=\"font-size: 18px; font-weight: bold; margin-bottom: 16px; border-bottom: 1px solid #ccc; padding-bottom: 8px;\">\n  Device Information\n</h2>\n\n<table style=\"width: 100%; border-collapse: collapse; margin-bottom: 24px;\">\n  <tr>\n    <td style=\"padding: 8px; border: 1px solid #ccc; width: 40%; font-weight: 600;\">Device Model/Name</td>\n    <td style=\"padding: 8px; border: 1px solid #ccc;\">{{device_model}}</td>\n  </tr>\n  <tr>\n    <td style=\"padding: 8px; border: 1px solid #ccc; font-weight: 600;\">Product Serial Number</td>\n    <td style=\"padding: 8px; border: 1px solid #ccc;\">{{serial_number}}</td>\n  </tr>\n  <tr>\n    <td style=\"padding: 8px; border: 1px solid #ccc; font-weight: 600;\">Charger Serial Number</td>\n    <td style=\"padding: 8px; border: 1px solid #ccc;\">{{charger_serial}}</td>\n  </tr>\n  <tr>\n    <td style=\"padding: 8px; border: 1px solid #ccc; font-weight: 600;\">IMEI Number (if applicable)</td>\n    <td style=\"padding: 8px; border: 1px solid #ccc;\">{{imei_number}}</td>\n  </tr>\n</table>\n\n<h2 style=\"font-size: 18px; font-weight: bold; margin-bottom: 16px; border-bottom: 1px solid #ccc; padding-bottom: 8px;\">\n  Terms and Conditions\n</h2>\n\n<div style=\"margin-bottom: 24px;\">\n  <p style=\"margin-bottom: 12px;\">By signing this undertaking, I agree to the following:</p>\n\n  <ol style=\"margin-left: 20px; line-height: 1.8;\">\n    <li style=\"margin-bottom: 8px;\">\n      <strong>IT Access:</strong> I understand that the Company's IT department may need access to my device\n      for security configuration, software installation, or troubleshooting purposes related to company work.\n    </li>\n    <li style=\"margin-bottom: 8px;\">\n      <strong>Data Responsibility:</strong> I acknowledge that I am responsible for maintaining the security\n      of company data stored on or accessed through my personal device. I will use appropriate security\n      measures including but not limited to password protection, encryption, and keeping software up to date.\n    </li>\n    <li style=\"margin-bottom: 8px;\">\n      <strong>Acceptable Use:</strong> I will use my device in accordance with the Company's IT policies\n      and acceptable use guidelines. I will not install or use software that may compromise company\n      security or data.\n    </li>\n    <li style=\"margin-bottom: 8px;\">\n      <strong>Data Separation:</strong> I understand that company data should be kept separate from personal\n      data where possible, and I will follow company guidelines for data handling and storage.\n    </li>\n    <li style=\"margin-bottom: 8px;\">\n      <strong>Loss or Theft:</strong> I will immediately report any loss, theft, or security breach\n      involving my device to the IT department and my manager.\n    </li>\n    <li style=\"margin-bottom: 8px;\">\n      <strong>Exit Procedures:</strong> Upon termination of employment, I agree to allow the IT department\n      to remove all company data, applications, and access credentials from my device.\n    </li>\n    <li style=\"margin-bottom: 8px;\">\n      <strong>No Company Liability:</strong> I understand that the Company is not responsible for loss,\n      damage, or theft of my personal device, nor for any personal data stored on my device.\n    </li>\n    <li style=\"margin-bottom: 8px;\">\n      <strong>Compliance:</strong> I agree to comply with all applicable data protection laws and\n      regulations when handling company data on my personal device.\n    </li>\n  </ol>\n</div>\n\n<h2 style=\"font-size: 18px; font-weight: bold; margin-bottom: 16px; border-bottom: 1px solid #ccc; padding-bottom: 8px;\">\n  Acknowledgment\n</h2>\n\n<div style=\"margin-bottom: 24px;\">\n  <p style=\"margin-bottom: 16px;\">\n    I have read and understood this BYOD Undertaking Form. I agree to abide by all terms and conditions\n    outlined above and any related company policies regarding the use of personal devices for work purposes.\n  </p>\n\n  <p style=\"margin-bottom: 16px;\">\n    I acknowledge that failure to comply with these terms may result in disciplinary action, up to and\n    including termination of employment.\n  </p>\n</div>\n\n<table style=\"width: 100%; border-collapse: collapse; margin-top: 32px;\">\n  <tr>\n    <td style=\"padding: 16px; width: 50%;\">\n      <p style=\"margin-bottom: 40px; font-weight: 600;\">Employee Signature:</p>\n      <p style=\"border-top: 1px solid #000; padding-top: 8px;\">{{employee_name}}</p>\n    </td>\n    <td style=\"padding: 16px; width: 50%;\">\n      <p style=\"margin-bottom: 40px; font-weight: 600;\">Date:</p>\n      <p style=\"border-top: 1px solid #000; padding-top: 8px;\">{{signature_date}}</p>\n    </td>\n  </tr>\n</table>\n","bodyMarkdown":null,"includeNda":false,"includePii":false,"variableSchema":{"job_title": {"type": "text", "label": "Job Title", "required": true}, "department": {"type": "text", "label": "Department", "required": true}, "imei_number": {"type": "text", "label": "IMEI Number", "required": false, "defaultValue": "N/A"}, "device_model": {"type": "text", "label": "Device Model/Name", "required": true}, "employee_name": {"type": "text", "label": "Employee Full Name", "required": true}, "serial_number": {"type": "text", "label": "Product Serial Number", "required": false, "defaultValue": "N/A"}, "charger_serial": {"type": "text", "label": "Charger Serial Number", "required": false, "defaultValue": "N/A"}, "signature_date": {"type": "date", "label": "Signature Date", "required": true}},"isActive":true,"createdAt":"2025-12-30T11:40:58.871","updatedAt":"2025-12-30T11:40:58.871","employmentType":null}]
